Revit 2027 API
FabricSheetType.MajorDirectionWireType Property
 The id of the FabricWireType to be used in the major direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MajorDirectionWireType { get; set; }
Public Property MajorDirectionWireType As ElementId
	Get
	Set
public:
property ElementId^ MajorDirectionWireType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member MajorDirectionWireType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: the ElementId majorDirectionWireType is either invalid or not a FabricWireType.
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: Fabric Sheet Type is Custom
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace